leeebo/esp32s2_usb/uvc_mjpeg/sdkconfig.defaults
#
# ESP-MQTT Configurations
#
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_TRANSPORT_SSL=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET_SECURE=y
# CONFIG_MQTT_MSG_ID_INCREMENTAL is not set
# CONFIG_MQTT_SKIP_PUBLISH_IF_DISCONNECTED is not set
# CONFIG_MQTT_REPORT_DELETED_MESSAGES is not set
# CONFIG_MQTT_USE_CUSTOM_CONFIG is not set
# CONFIG_MQTT_TASK_CORE_SELECTION_ENABLED is not set
# CONFIG_MQTT_CUSTOM_OUTBOX is not set
# end of ESP-MQTT Configurations

#
# Newlib
#
CONFIG_NEWLIB_STDOUT_LINE_ENDING_CRLF=y
# CONFIG_NEWLIB_STDOUT_LINE_ENDING_LF is not set
# CONFIG_NEWLIB_STDOUT_LINE_ENDING_CR is not set
# CONFIG_NEWLIB_STDIN_LINE_ENDING_CRLF is not set
# CONFIG_NEWLIB_STDIN_LINE_ENDING_LF is not set
CONFIG_NEWLIB_STDIN_LINE_ENDING_CR=y
# CONFIG_NEWLIB_NANO_FORMAT is not set
# end of Newlib

#
# NVS
#
# end of NVS

#
# OpenSSL
#
# CONFIG_OPENSSL_DEBUG is not set
CONFIG_OPENSSL_ERROR_STACK=y
# CONFIG_OPENSSL_ASSERT_DO_NOTHING is not set
CONFIG_OPENSSL_ASSERT_EXIT=y
# end of OpenSSL

#
# PThreads
#
CONFIG_PTHREAD_TASK_PRIO_DEFAULT=5
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=3072
CONFIG_PTHREAD_STACK_MIN=768
CONFIG_PTHREAD_TASK_CORE_DEFAULT=-1
CONFIG_PTHREAD_TASK_NAME_DEFAULT="pthread"
# end of PThreads

#
# SPI Flash driver
#
# CONFIG_SPI_FLASH_VERIFY_WRITE is not set
# CONFIG_SPI_FLASH_ENABLE_COUNTERS is not set
CONFIG_SPI_FLASH_ROM_DRIVER_PATCH=y
CONFIG_SPI_FLASH_DANGEROUS_WRITE_ABORTS=y
# CONFIG_SPI_FLASH_DANGEROUS_WRITE_FAILS is not set
# CONFIG_SPI_FLASH_DANGEROUS_WRITE_ALLOWED is not set
# CONFIG_SPI_FLASH_USE_LEGACY_IMPL is not set
# CONFIG_SPI_FLASH_BYPASS_BLOCK_ERASE is not set
CONFIG_SPI_FLASH_YIELD_DURING_ERASE=y
CONFIG_SPI_FLASH_ERASE_YIELD_DURATION_MS=20
CONFIG_SPI_FLASH_ERASE_YIELD_TICKS=1
CONFIG_SPI_FLASH_WRITE_CHUNK_SIZE=8192
# CONFIG_SPI_FLASH_SIZE_OVERRIDE is not set
# CONFIG_SPI_FLASH_CHECK_ERASE_TIMEOUT_DISABLED is not set

#
# Auto-detect flash chips
#
CONFIG_SPI_FLASH_SUPPORT_ISSI_CHIP=y
CONFIG_SPI_FLASH_SUPPORT_MXIC_CHIP=y
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=y
CONFIG_SPI_FLASH_SUPPORT_WINBOND_CHIP=y
CONFIG_SPI_FLASH_SUPPORT_BOYA_CHIP=y
# end of Auto-detect flash chips

CONFIG_SPI_FLASH_ENABLE_ENCRYPTED_READ_WRITE=y
# end of SPI Flash driver

#
# SPIFFS Configuration
#
CONFIG_SPIFFS_MAX_PARTITIONS=3

#
# SPIFFS Cache Configuration
#
CONFIG_SPIFFS_CACHE=y
CONFIG_SPIFFS_CACHE_WR=y
# CONFIG_SPIFFS_CACHE_STATS is not set
# end of SPIFFS Cache Configuration

CONFIG_SPIFFS_PAGE_CHECK=y
CONFIG_SPIFFS_GC_MAX_RUNS=10
# CONFIG_SPIFFS_GC_STATS is not set
CONFIG_SPIFFS_PAGE_SIZE=256
CONFIG_SPIFFS_OBJ_NAME_LEN=32
# CONFIG_SPIFFS_FOLLOW_SYMLINKS is not set
CONFIG_SPIFFS_USE_MAGIC=y
CONFIG_SPIFFS_USE_MAGIC_LENGTH=y
CONFIG_SPIFFS_META_LENGTH=4
CONFIG_SPIFFS_USE_MTIME=y

#
# Debug Configuration
#
# CONFIG_SPIFFS_DBG is not set
# CONFIG_SPIFFS_API_DBG is not set
# CONFIG_SPIFFS_GC_DBG is not set
# CONFIG_SPIFFS_CACHE_DBG is not set
# CONFIG_SPIFFS_CHECK_DBG is not set
# CONFIG_SPIFFS_TEST_VISUALISATION is not set
# end of Debug Configuration
# end of SPIFFS Configuration

#
# TCP Transport
#
CONFIG_WS_BUFFER_SIZE=1024
# end of TCP Transport

#
# TinyUSB
#
# CONFIG_USB_ENABLED is not set
# end of TinyUSB

#
# Unity unit testing library
#
CONFIG_UNITY_ENABLE_FLOAT=y
CONFIG_UNITY_ENABLE_DOUBLE=y
# CONFIG_UNITY_ENABLE_COLOR is not set
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=y
# CONFIG_UNITY_ENABLE_FIXTURE is not set
# CONFIG_UNITY_ENABLE_BACKTRACE_ON_FAIL is not set
# end of Unity unit testing library

#
# Virtual file system
#
CONFIG_VFS_SUPPORT_IO=y
CONFIG_VFS_SUPPORT_DIR=y
CONFIG_VFS_SUPPORT_SELECT=y
CONFIG_VFS_SUPPRESS_SELECT_DEBUG_OUTPUT=y
CONFIG_VFS_SUPPORT_TERMIOS=y

#
# Host File System I/O (Semihosting)
#
CONFIG_VFS_SEMIHOSTFS_MAX_MOUNT_POINTS=1
CONFIG_VFS_SEMIHOSTFS_HOST_PATH_MAX_LEN=128
# end of Host File System I/O (Semihosting)
# end of Virtual file system

#
# Wear Levelling
#
# CONFIG_WL_SECTOR_SIZE_512 is not set
CONFIG_WL_SECTOR_SIZE_4096=y
CONFIG_WL_SECTOR_SIZE=4096
# end of Wear Levelling

#
# Wi-Fi Provisioning Manager
#
CONFIG_WIFI_PROV_SCAN_MAX_ENTRIES=16
CONFIG_WIFI_PROV_AUTOSTOP_TIMEOUT=30
# end of Wi-Fi Provisioning Manager

#
# Supplicant
#
CONFIG_WPA_MBEDTLS_CRYPTO=y
# CONFIG_WPA_WAPI_PSK is not set
# CONFIG_WPA_DEBUG_PRINT is not set
# CONFIG_WPA_TESTING_OPTIONS is not set
# CONFIG_WPA_WPS_WARS is not set
# CONFIG_WPA_11KV_SUPPORT is not set
# end of Supplicant

#
# Bus Options
#

#
# I2C Bus Options
#
CONFIG_I2C_BUS_DYNAMIC_CONFIG=y
CONFIG_I2C_MS_TO_WAIT=200
# end of I2C Bus Options
# end of Bus Options

#
# IoT Button
#
CONFIG_BUTTON_PERIOD_TIME_MS=5
CONFIG_BUTTON_DEBOUNCE_TICKS=2
CONFIG_BUTTON_SHORT_PRESS_TIME_MS=180
CONFIG_BUTTON_LONG_PRESS_TIME_MS=1500
CONFIG_ADC_BUTTON_MAX_CHANNEL=3
CONFIG_ADC_BUTTON_MAX_BUTTON_PER_CHANNEL=8
CONFIG_ADC_BUTTON_SAMPLE_TIMES=1
# end of IoT Button

#
# LCD Drivers
#

#
# Select Screen Controller
#
CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_ILI9341=y
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_ILI9486 is not set
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_ILI9806 is not set
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_NT35510 is not set
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_RM68120 is not set
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_SSD1351 is not set
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_ST7789 is not set
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_ST7796 is not set
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_SSD1306 is not set
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_SSD1307 is not set
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_SSD1322 is not set
# end of Select Screen Controller
# end of LCD Drivers

#
# Touch Screen Driver
#

#
# Choose Touch Screen Driver
#
# CONFIG_TOUCH_DRIVER_XPT2046 is not set
CONFIG_TOUCH_DRIVER_FT5X06=y
# CONFIG_TOUCH_DRIVER_NS2016 is not set
# end of Choose Touch Screen Driver

CONFIG_TOUCH_PANEL_MAX_CALIBRATE_ERROR=100
CONFIG_TOUCH_PANEL_THRESHOLD_PRESS=150
# end of Touch Screen Driver

#
# LVGL configuration
#
CONFIG_LVGL_DRIVER_TOUCH_SCREEN_ENABLE=y
# CONFIG_LVGL_COLOR_SCREEN_TRANSP is not set
CONFIG_LVGL_ANTIALIAS=y
CONFIG_LVGL_DISP_DEF_REFR_PERIOD=30
CONFIG_LVGL_DPI=130
CONFIG_LVGL_DISP_SMALL_LIMIT=30
CONFIG_LVGL_DISP_MEDIUM_LIMIT=50
CONFIG_LVGL_DISP_LARGE_LIMIT=70

#
# Font usage
#
# CONFIG_LVGL_FONT_FMT_TXT_LARGE is not set
# CONFIG_LVGL_FONT_SUBPX_BGR is not set

#
# Enable built-in fonts
#
# CONFIG_LVGL_FONT_MONTSERRAT_12 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_14 is not set
CONFIG_LVGL_FONT_MONTSERRAT_16=y
# CONFIG_LVGL_FONT_MONTSERRAT_18 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_20 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_22 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_24 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_26 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_28 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_30 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_32 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_34 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_36 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_38 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_40 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_42 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_44 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_46 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_48 is not set
# CONFIG_LVGL_FONT_UNSCII8 is not set
# CONFIG_LVGL_FONT_MONTSERRAT12SUBPIX is not set
# CONFIG_LVGL_FONT_MONTSERRAT28COMPRESSED is not set
# CONFIG_LVGL_FONT_DEJAVU_16_PERSIAN_HEBREW is not set
# CONFIG_LVGL_FONT_SIMSUN_16_CJK is not set
# end of Enable built-in fonts

# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_12 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_14 is not set
CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_16=y
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_18 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_20 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_22 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_24 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_26 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_28 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_30 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_32 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_34 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_36 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_38 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_40 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_42 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_44 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_46 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_48 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_UNSCII8 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT12SUBPIX is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT28COMPRESSED is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_DEJAVU_16_PERSIAN_HEBREW is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_SIMSUN_16_CJK is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_12 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_14 is not set
CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_16=y
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_18 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_20 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_22 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_24 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_26 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_28 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_30 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_32 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_34 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_36 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_38 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_40 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_42 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_44 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_46 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_48 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_UNSCII8 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT12SUBPIX is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT28COMPRESSED is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_DEJAVU_16_PERSIAN_HEBREW is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_SIMSUN_16_CJK is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_12 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_14 is not set
CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_16=y
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_18 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_20 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_22 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_24 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_26 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_28 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_30 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_32 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_34 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_36 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_38 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_40 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_42 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_44 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_46 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_48 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_UNSCII8 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT12SUBPIX is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT28COMPRESSED is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_DEJAVU_16_PERSIAN_HEBREW is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_SIMSUN_16_CJK is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_12 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_14 is not set
CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_16=y
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_18 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_20 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_22 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_24 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_26 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_28 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_30 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_32 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_34 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_36 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_38 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_40 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_42 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_44 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_46 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_48 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_UNSCII8 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT12SUBPIX is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT28COMPRESSED is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_DEJAVU_16_PERSIAN_HEBREW is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_SIMSUN_16_CJK is not set
# end of Font usage

#
# Theme usage
#

#
# Enable theme usage, always enable at least one theme
#
# CONFIG_LVGL_THEME_EMPTY is not set
# CONFIG_LVGL_THEME_TEMPLATE is not set
CONFIG_LVGL_THEME_MATERIAL=y
# CONFIG_LVGL_THEME_MONO is not set
# end of Enable theme usage, always enable at least one theme

# CONFIG_LVGL_THEME_DEFAULT_INIT_EMPTY is not set
# CONFIG_LVGL_THEME_DEFAULT_INIT_TEMPLATE is not set
CONFIG_LVGL_THEME_DEFAULT_INIT_MATERIAL=y
# CONFIG_LVGL_THEME_DEFAULT_INIT_MONO is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_WHITE is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_SILVER is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_GRAY is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_BLACK is not set
CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_RED=y
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_MAROON is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_YELLOW is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_OLIVE is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_LIME is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_GREEN is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_CYAN is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_AQUA is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_TEAL is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_BLUE is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_NAVY is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_MAGENTA is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_PURPLE is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_ORANGE is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_WHITE is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_SILVER is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_GRAY is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_BLACK is not set
CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_RED=y
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_MAROON is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_YELLOW is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_OLIVE is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_LIME is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_GREEN is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_CYAN is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_AQUA is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_TEAL is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_BLUE is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_NAVY is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_MAGENTA is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_PURPLE is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_ORANGE is not set
CONFIG_LVGL_THEME_DEFAULT_FLAG_LIGHT=y
# CONFIG_LVGL_THEME_DEFAULT_FLAG_DARK is not set
# end of Theme usage

#
# Memory manager settings
#
CONFIG_LVGL_MEM_SIZE=32
# end of Memory manager settings

#
# Log Settings
#
# CONFIG_LVGL_USE_LOG is not set
CONFIG_LVGL_LOG_PRINTF=y
# end of Log Settings

#
# Debug Settings
#
CONFIG_LVGL_USE_DEBUG=y
CONFIG_LVGL_USE_ASSERT_NULL=y
CONFIG_LVGL_USE_ASSERT_MEM=y
# CONFIG_LVGL_USE_ASSERT_MEM_INTEGRITY is not set
# CONFIG_LVGL_USE_ASSERT_STR is not set
# CONFIG_LVGL_USE_ASSERT_OBJ is not set
# CONFIG_LVGL_USE_ASSERT_STYLE is not set
# end of Debug Settings

#
# Text Settings
#
CONFIG_LVGL_TXT_ENC_UTF8=y
# CONFIG_LVGL_TXT_ENC_ASCII is not set
CONFIG_LVGL_TXT_BREAK_CHARS=" ,.;:-_"
CONFIG_LVGL_TXT_LINE_BREAK_LONG_LEN=0
CONFIG_LVGL_TXT_LINE_BREAK_LONG_PRE_MIN_LEN=3
CONFIG_LVGL_TXT_LINE_BREAK_LONG_POST_MIN_LEN=3
CONFIG_LVGL_TXT_COLOR_CMD="#"
CONFIG_LVGL_BIDI_NO_SUPPORT=y
# CONFIG_LVGL_BIDI_DIR_LTR is not set
# CONFIG_LVGL_BIDI_DIR_RTL is not set
# CONFIG_LVGL_BIDI_DIR_AUTO is not set
# CONFIG_LVGL_USE_ARABIC_PERSIAN_CHARS is not set
# CONFIG_LVGL_SPRINTF_CUSTOM is not set
# CONFIG_LVGL_SPRINTF_DISABLE_FLOAT is not set
# end of Text Settings

